---
kind: method
id: M:Autodesk.Revit.DB.FormattedText.Dispose
source: html/b9fff006-84a5-3e0f-a6db-1d939a0e7ccc.htm
---
# Autodesk.Revit.DB.FormattedText.Dispose Method

Releases all resources used by the FormattedText

## Syntax (C#)
```csharp
public void Dispose()
```